/****************************************************
 * ファイル名　：Reset.ino　
 * 役割　　　　：既存値のリセット
 * 作成日　　　：2024.02.04
 * 分類　　　　：共用
 ***************************************************/
/*** 利用ファイルのヘッダ ***/

/***** 公開関数 ************************************************/
/****************************************************
 * 関数名　：reset
 * 機能　　：各状態のリセット
 * 引数　　：なし
 * 戻り値　：なし
 * 備考　　：各ファイルのグローバル変数を書き換える
 ***************************************************/
void reset()
{
  /* 小数桁(UpdateValue.ino) */
  rstDecDigit();

  /* 小数入力モード(JudgNumSw.ino) */
  rstDecFrag();

  /* 計算処理関係(CalcManager.ino) */
  rstCalc();
}